Revit 2027 API
ColumnAttachment.RemoveColumnAttachment(FamilyInstance, ElementId) Method
 Removes any attachment of the column to the specified target.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RemoveColumnAttachment(
	FamilyInstance column,
	ElementId targetId
)
Public Shared Sub RemoveColumnAttachment (
	column As FamilyInstance,
	targetId As ElementId
)
public:
static void RemoveColumnAttachment(
	FamilyInstance^ column,
	ElementId^ targetId
)
static member RemoveColumnAttachment :
        column : FamilyInstance *
        targetId : ElementId -> unit
Parameters
column FamilyInstance
 A column.
targetId ElementId
 Id of a target element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This method modifies both column and target elements.
See Also
Reference
ColumnAttachment Class
RemoveColumnAttachment Overload
Autodesk.Revit.DB Namespace